app/controllers/users_controller.rb

  def create
    user_params = params.require(:user).permit(:first_name, :last_name, :current_city, :email, :password)
    @user = User.create(user_params)
---
INSERT INTO "users" ("first_name", "last_name", "current_city", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def edit
    user_id = params[:id]
     @user = User.find_by_id(user_id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 7]]

  def update
     user_id = params[:id]
     user = User.find_by_id(user_id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 7]]